Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པ་འདི་ལ་གནས་པ་ནི་ཏིང་ངེ་འཛིན་དང་མ་བྲལ་བ་ཡིན། སེམས་འཁྲུལ་པ་མེད་པ་ཡིན། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་ཞིང་སེམས་ཅན་དཔག་ཏུ་མེད་པའི་དོན་བྱེད་པ་ཡིན་ནོ།
en: Bodhisattva mahāsattvas who are established in this teaching of samādhi become inseparable from samādhi—their minds become free of delusion, they become endowed with great compassion, and they accomplish the benefit of countless beings.”

source: །ཏིང་འཛིན་མཉམ་པ་མེད་པའི་ས།
en: “The level of unequaled samādhi

source: །ཤིན་ཏུ་མཐོང་དཀའ་ཕྲ་ཞིང་ཞི། །འདུ་ཤེས་ཐམས་ཅད་བཅོམ་པ་སྟེ།
en: Is peaceful, subtle, and difficult to see. All conceptions have been eliminated.

source: །དེ་ཕྱིར་ཏིང་ངེ་འཛིན་ཅེས་བྱ།
en: Therefore it is called samādhi. {1}

source: །རྟོག་པ་མེད་ཅིང་རྣམ་རྟོག་མེད།
en: “There are no notions, there are no concepts,

source: །གཟུང་བ་མེད་ཅིང་བསྟན་དུ་མེད།
en: There is nothing to be grasped, there is nothing to be shown,

source: །སེམས་ཀྱང་དམིགས་པ་མེད་པ་སྟེ།
en: And there is no object for the mind.

source: །དེ་ཕྱིར་ཏིང་ངེ་འཛིན་ཅེས་བྱ། །ནམ་ཞིག་མཉམ་པར་གཞག་གྱུར་ཏེ།
en: Therefore it is called samādhi. {2} “When in a state of meditation

source: །ཆོས་ཀུན་ལ་ནི་རློམ་སེམས་མེད།
en: There is no pride concerning any phenomenon.

source: །རློམ་སེམས་མེད་པ་ཇི་བཞིན་པ།
en: That very absence of pride—

source: །དེ་ནི་ཏིང་ངེ་འཛིན་ཅེས་བསྒྲགས།
en: That is what is called samādhi. {3}

source: །ཆོས་ནི་རྡུལ་ཙམ་ཡོང་མེད་དེ།
en: “There does not exist even an atom of phenomena.

source: །རྡུལ་ཅེས་བྱ་བའང་ཡོད་མ་ཡིན།
en: That which is called ‘an atom’ does not exist.

source: །ཆོས་རྣམས་དམིགས་སུ་མེད་པ་སྟེ།
en: There are no phenomena as objects for the mind.

source: །སེམས་ཀྱི་དམིགས་པ་མེད་པ་ཡང་།
en: “ ‘The mind has no object’

source: །དེ་ནི་རྣམ་པར་རྟོག་ཅེས་བྱ།
en: Is also itself a concept.

source: །ཆོས་དེ་རྣམ་པར་མ་བརྟགས་པ།
en: When there are no concepts of phenomena,

source: །དེ་ལྟར་ཏིང་འཛིན་ཤེས་པར་གྱིས།
en: Then that is known as samādhi. {5}

source: །སྒྲ་ཡིས་དོན་རྣམས་རབ་བསྟན་ཏེ།
en: “A word indicates a meaning.

source: །སྒྲ་དེ་ཉིད་ཀྱང་དངོས་པོ་མེད།
en: That word is not a thing.

source: །སྒྲ་ནི་བྲག་ཅ་ལྟ་བུ་སྟེ།
en: A word is like an echo,

source: །བར་སྣང་དག་གི་ནམ་མཁའ་བཞིན།
en: Like the space of the sky. {6}

source: །ཆོས་འདི་རྣམས་ནི་མི་གནས་ཏེ།
en: “These phenomena are not present;

source: །འདི་དག་ལ་ནི་གནས་མི་དམིགས།
en: There is no presence to be perceived.

source: །མི་གནས་པ་ནི་གནས་ཀྱི་སྒྲར།
en: The nonpresence is through the word ‘presence.’

source: །ངོ་བོ་ཉིད་ཀྱིས་མི་རྙེད་དོ།
en: Its nature is that there is nothing to be found. {7}

source: །འགྲོ་ཞིང་འཆི་འཕོར་བརྗོད་པ་ཡི།
en: “One says ‘going’ and ‘passing away,’

source: །དེ་ལྟ་བུ་ཡི་འགྲོ་བ་མེད།
en: But that ‘going’ does not exist.

source: །འགྲོ་བ་མེད་པ་འགྲོ་བའི་སྒྲས།
en: Through the word ‘going’ there is the absence of going.

source: །ཏིང་ངེ་འཛིན་དུ་དེ་ཕྱིར་གསུངས།
en: That is given the name samādhi. {8}

source: །མཉམ་གཞག་མ་ཡིན་དེ་ནི་རློམ་སེམས་བརྗོད།
en: “Saying ‘I am not meditating’ is called pride.

source: །མཉམ་གཞག་འདི་ཡང་རློམ་སེམས་གཉིས་པ་སྟེ།
en: ‘I am meditating’ is a second kind of pride.

source: །རློམ་སེམས་མེད་པར་བྱང་ཆུབ་རིམ་པར་སྤྱོད།
en: Practicing for enlightenment without pride,

source: །དྲན་པ་རློམ་སེམས་མེད་པ་བྱང་ཆུབ་མཆོག །མཉམ་དང་མི་མཉམ་ཞི་བ་སངས་རྒྱས་ས།
en: And attaining the absence of pride is the highest enlightenment. {9} “This unequaled equality is the level of peace;

source: །ཞི་གནས་ལྷག་མཐོང་མཚན་མེད་འདི་ཡིན་ཏེ།
en: It is śamatha and vipaśyanā, devoid of attributes.

source: །ཞི་བ་སངས་རྒྱས་ས་འདི་བསྟེན་བྱས་ན།
en: Relying upon this peace, the level of buddhahood,

source: །ཏིང་འཛིན་ཞི་བ་འདི་ལ་དེ་བརྩོན་ཡིན།
en: Is engaging in the meditation of samādhi. {10}

source: །དོན་གྱི་རྣམ་པར་རིག་པ་འཇུག་པ་ལ། །ཡི་གེ་དག་གིས་འཇུག་པར་མི་ནུས་ཏེ།
en: “It is not possible through words to enter Into the understanding of the meaning.

source: །སྒྲ་དབྱངས་ཐམས་ཅད་རྣམ་པར་སྤངས་ནས་ནི།
en: When all sounds and words are abandoned

source: །མཉམ་པར་བཞག་འགྱུར་དེ་ལ་རློམ་སེམས་མེད། །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཏིང་འཛིན་འདི། །ཇི་ལྟར་བཤད་བཞིན་གནས་ཤིང་བརྩོན་བྱེད་ན།
en: There will be meditation without pride. {11}

source: །གལ་ཏེ་ཞིང་འདི་བསྐལ་པས་ཚིག་གྱུར་ཀྱང་།
en: “When there is the fire of the eon’s end in this world

source: །རི་མཆོག་དབུས་སུ་ཞུགས་པས་མེས་མི་ཚིག །བསྐལ་པ་བརྒྱ་ཕྲག་མང་པོར་རབ་བསྲེགས་ཀྱང་། །ནམ་མཁའ་སྔོན་ཆད་ནམ་ཡང་མི་འཚིག་བཞིན།
en: That fire does not burn the supreme mountain in its center, Just like space that has never been burned in the past, Even though the fire burns for many hundreds of eons. {12} “The bodhisattvas who remain engaged In this samādhi as it has been taught,

source: །ཆོས་རྣམས་ནམ་མཁའ་མཚུངས་པར་རྣམ་རིག་པས།
en: And know that phenomena are the same as space,

source: །དེ་ནི་མེ་ཡི་ནང་དུ་ཡོང་མི་འཚིག །གལ་ཏེ་སངས་རྒྱས་ཞིང་རྣམས་འབར་གྱུར་ལ།
en: Will also not be burned by fire. {13} “If the buddha realm were burning

source: །འབར་བ་འདི་དག་མ་ལུས་ཞི་ཤིག་ཅེས། །ཏིང་འཛིན་གནས་ནས་སྨོན་ལམ་འདི་བཏབ་ན།
en: And in this samādhi they prayed For the burning to completely cease,

source: །ས་རྣམས་ཞིག་ཀྱང་དེ་ལ་འགྱུར་བ་མེད།
en: Though the earth was destroyed it would be unchanged. {14}

source: །དེ་ནི་རྫུ་འཕྲུལ་སྟོབས་ཀྱང་མཐའ་ཡས་འགྱུར།
en: “They will have infinite miraculous powers.

source: །ནམ་མཁའ་ལ་ཡང་ཐོགས་པ་མེད་པར་འགྲོ།
en: They will travel through the air unimpeded.

source: །རྗེས་སུ་བསྟན་བཞིན་ཏིང་འཛིན་གནས་པ་ནི། །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་འདི་དག་མྱོང་།
en: The bodhisattvas will have these qualities By remaining in samādhi just as they have been taught. {15}

source: །སྐྱེ་ཞིང་འཆི་འཕོར་དེ་འགྱུར་ཡང་།
en: “Though one is born and though one dies,

source: །སྐྱེ་བ་མེད་ཅིང་འཆི་འཕོ་མེད།
en: There is no birth and there is no death.

source: །གང་གིས་དེ་ལྟར་རྣམ་རིག་པ།
en: For the one who understands that

source: །དེ་ལ་ཏིང་འཛིན་རྙེད་མི་དཀའ།
en: This samādhi will not be difficult to attain. {16} “The Lord of the World has taught

source: །འཆི་འཕོ་སྐྱེ་བ་མེད་པར་ནི། །འཇིག་རྟེན་མགོན་པོས་རབ་ཏུ་བཤད།
en: That there is no death and there is no birth.

source: །དེ་ལྟར་འཇིག་རྟེན་མགོན་རིག་ནས།
en: Just as the Lord of the World knew that,

source: །དེ་ཕྱིར་ཏིང་ངེ་འཛིན་ཀྱང་རིག །འཇིག་རྟེན་གྱིས་ནི་མ་གོས་ཤིང་།
en: You should also know it through this samādhi. {17} “Unstained by the world,

source: །འཇིག་རྟེན་ཆོས་ལ་མི་ཆགས་ཏེ།
en: They have no attachment to worldly phenomena.

source: །ལུས་ནི་ཐོགས་པ་མེད་པར་ནི།
en: With a body free of impediment

source: །སངས་རྒྱས་ཞིང་དུ་འགྲོ་བར་བྱེད། །ཞིང་དག་ན་ནི་འཇིག་རྟེན་འདྲེན། །རྫོགས་པའི་སངས་རྒྱས་རྟག་ཏུ་མཐོང་།
en: They go to the buddha realms. {18} “They constantly see in those realms The perfect buddhas, the guides of the world.

source: །སངས་རྒྱས་དག་གིས་ཞིང་བཤད་པ། །ཆོས་རྣམས་དེ་དག་དེར་ཡང་ཉན།
en: They listen there to the Dharma That is taught in the realms of the buddhas. {19}

source: །དེ་ལ་མི་ཤེས་ཡོང་མེད་དེ།
en: “They will never be in ignorance.

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱང་རབ་ཏུ་འཆད།
en: They will teach the essence of phenomena.

source: །ཆོས་ཀྱི་རྣམ་པ་རྟག་ཏུ་རིག །དེ་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ།
en: They always know the way of phenomena, Which is composed of the essence of phenomena. {20}

source: །བསྐལ་པ་བྱེ་བར་འཆད་སྟོན་ཀྱང་།
en: “Even though they teach for ten million eons,

source: །དེ་ཡི་སྤོབས་པ་ཟད་མི་འགྱུར།
en: Their confidence in speech will not decline.

source: །བྱང་ཆུབ་སེམས་དཔའ་གཞན་མང་པོ། །མཁས་པ་དག་ཀྱང་སྤྲུལ་པར་བྱེད།
en: They emanate many other bodhisattvas Who have wisdom. {21}

source: །བྱང་ཆུབ་སེམས་དཔའ་སྤྲུལ་པ་ནི། །པད་མ་འདབ་མ་སྟོང་དག་ལ།
en: “The emanated bodhisattvas

source: །སྐྱིལ་མོ་ཀྲུང་བཅས་འདུག་པ་དག །ཞིང་ནས་ཞིང་དུ་འགྲོ་བར་བྱེད།
en: Travel from realm to realm. They are seated, cross-legged,

source: །ཏིང་འཛིན་ཞི་བ་བསྒོམས་ནས་ནི།
en: Upon lotuses that have a thousand petals. {22}

source: །གཟུངས་དང་མདོ་སྡེ་བཟང་པོ་དང་། །མདོ་སྡེ་གཞན་ཡང་བྱེ་བ་དང་། །སངས་རྒྱས་བྱང་ཆུབ་རབ་ཏུ་སྟོན།
en: “They teach the enlightenment of buddhahood, Wonderful dhāraṇīs and sūtras, And ten million other sūtras, While meditating peacefully in samādhi. {23} “They establish in irreversibility

source: །སེམས་ཅན་མང་པོ་བསམ་མི་ཁྱབ། །ཕྱིར་མི་ལྡོག་ལ་འགོད་པར་བྱེད།
en: Countless multitudes of beings,

source: །སངས་རྒྱས་བྱང་ཆུབ་རབ་སྟོན་ཀྱང་།
en: And teach the enlightenment of buddhahood

source: །སྤོབས་པ་དག་ནི་ཟད་མི་འགྱུར།
en: Without their confidence in speech ever declining. {24} “They go to a pinnacled hall

source: །རིན་ཆེན་རྣམ་པར་བརྒྱན་པ་ཡི། །ཁང་པ་བརྩེགས་ཞུགས་དེ་འགྲོ་སྟེ།
en: That is adorned with jewels

source: །དྲི་དང་ལྡན་པའི་མེ་ཏོག་གིས། །འདྲེན་པ་ལ་ཡང་མངོན་པར་འཐོར།
en: And scatter aromatic Flowers upon the guides. {25}

source: །དྲི་དང་ལྡན་པའི་ཕྱེ་མས་ཀྱང་།
en: “They also sprinkle scented

source: །འདྲེན་པ་ལ་ནི་རབ་ཏུ་འཐོར།
en: Powders upon the guides.

source: །དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཕྱིར། །རྒྱ་ཆེ་བ་ཡི་མཆོད་པ་བྱེད།
en: They all make vast offerings In order to attain enlightenment. {26} “Those countless qualities

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱོབ་པ་ཡི། །ཡོན་ཏན་དཔག་མེད་དེ་དག་ནི།
en: Are the refuge of the bodhisattvas.

source: །ནམ་ཞིག་ཉོན་མོངས་མེད་གྱུར་པ།
en: When they are free of kleśas

source: །དེ་ཚེ་རྫུ་འཕྲུལ་དེ་དག་འཐོབ།
en: They attain those miraculous powers. {27}

source: །ཉོན་མོངས་དག་ནི་མི་སྐྱེ་ཞིང་།
en: “Because the kleśas are not created

source: །དག་པ་དང་བ་འོད་གསལ་བ།
en: They are clear, pure, and bright.

source: །མི་འཁྲུགས་འདུས་མ་བྱས་པ་ནི། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The field of activity of the bodhisattvas Is noncomposite and inviolate. {28}

source: །རབ་ཏུ་ཞི་ཞིང་ཉེ་བར་ཞི།
en: “They have perfect peace, complete peace;

source: །ཉོན་མོངས་མེད་ཅིང་མྱ་ངན་བྲལ།
en: They have no kleśas, and they have no misery.

source: །སྤྲོས་མེད་རྣམ་པར་མ་སྤྲོས་པ།
en: They have no conceptualization, are free of conceptualization,

source: །སྤྲོས་པ་དག་ལས་ཤིན་ཏུ་འདས། །ཡི་གེའི་སྤྱོད་པ་མེད་པ་ནི།
en: And have transcended conceptualization. {29}

source: །ཆོས་རྣམས་ཀུན་གྱི་མཚན་ཉིད་དེ།
en: “This characteristic of phenomena Is beyond the scope of words.

source: །དབྱངས་ཀྱིས་རིག་པར་དགའ་བས་ན།
en: It is difficult to know through language

source: །དེ་ཕྱིར་ཏིང་ངེ་འཛིན་ཅེས་བྱ། །ཟད་མི་ཤེས་ཤིང་ཉེ་བར་ཞི།
en: And therefore it is called samādhi. {30} “It is unending; it is complete peace;

source: །ལྷུན་གྱིས་འགྲུབ་ཅིང་བསྟན་མེད་པ། །རྙོག་མེད་ཡང་དག་ཉིད་ཀྱི་མཐའ།
en: It is effortless, and it cannot be shown.

source: །སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་ལོ། །འོང་དང་འགྲོ་བ་མེད་པ་དང་། །སྤྲོས་མེད་ལྷུན་གྱིས་གྲུབ་པ་ཡི།
en: The field of activity of all the buddhas

source: །ཆོས་རྣམས་ཀུན་གྱི་རང་བཞིན་ནི།
en: Is the completely pure summit of the truth. {31}

source: །སངས་རྒྱས་ཀུན་གྱི་བསླབ་པ་སྟེ།
en: “The training of all the buddhas Is in the nature of all phenomena.

source: །རྫོགས་པའི་སངས་རྒྱས་འདི་བསླབས་ནས།
en: The perfect buddhas, having trained in it,

source: །ཡོན་ཏན་དག་གི་ཕ་རོལ་ཕྱིན། །ཚུ་རོལ་དང་ནི་ཕ་རོལ་མེད།
en: Have reached the perfection of qualities. {32}

source: །སྔོན་མཐའ་རྣམ་པར་མ་བརྟགས་ཏེ།
en: “Without any concepts of the past, Of this side and the further side,

source: །དེ་ཕྱིར་སངས་རྒྱས་དེ་དག་ཀུན།
en: In that way all those buddhas

source: །ཡོན་ཏན་དག་གི་ཕ་རོལ་ཕྱིན།
en: Have reached the perfection of qualities. {33} “Knowing the nature of phenomena

source: །འོང་དང་འགྲོ་བ་མེད་པ་དང་། །སྤྲོས་མེད་ལྷུན་གྱིས་གྲུབ་པ་ཡི། །ཆོས་ཀྱི་རང་བཞིན་མཁྱེན་ནས་ནི།
en: As having no coming or going,

source: །དེ་དག་དེ་ལས་ཕ་རོལ་ཕྱིན།
en: They have reached the perfection That is nonconceptual and effortless.” {34}

source: །ཏིང་ངེ་འཛིན་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་བཅུ་གསུམ་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ།
en: Conclusion of the thirteenth chapter, “The Teaching of the Samādhi.”

source: བམ་པོ་ལྔ་པ།
en: The Buddha’s Smile Chapter 14

source: དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བསླབ་པའི་ཏིང་ངེ་འཛིན་བསྟན་པ་ལེགས་པར་བཤད་པ་ནི་ངོ་མཚར་ཏོ།
en: Then the youth Candraprabha rose from his seat, removed his robe from one shoulder, and, kneeling on his right knee, with palms placed together he bowed toward the Bhagavān and said to him, “Bhagavān, it is marvelous that the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha has taught the equality that is the nature of all phenomena, which is the samādhi that all bodhisattvas train in.

source: །འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུན་རིང་པོར་བསླབ་པ་འདི་ལ་བསླབས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་པ་ནི་བཅོམ་ལྡན་འདས་བདག་སྤོབས་སོ། །བདེ་བར་གཤེགས་པ་བདག་སྤོབས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Bhagavān, it was thus, in this training, that the Bhagavān trained for a long time, and accomplished the highest, complete enlightenment of perfect buddhahood. Bhagavān, that gives me confidence to speak. Sugata, it gives me confidence to speak.”

source: གཞོན་ནུ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྐབས་ཕྱེ་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་སུམ་དུ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བསྟོད་དོ།
en: The Bhagavān said, “Young man, if you think the time has come, be confident to speak.” Since the Bhagavān had granted the youth Candraprabha this opportunity, Candraprabha spoke the following verses of praise directly to the Bhagavān. “You saw beings tormented by suffering,

source: །འདོད་དང་ཁྲོ་བས་རྟག་ཏུ་ཟིལ་ནོན་ཅིང་།
en: Constantly overpowered by desire and anger,

source: །སྡུག་བསྔལ་གཙེས་པའི་སེམས་ཅན་གཟིགས་ནས་ནི།
en: And developed the aspiration to attain enlightenment:

source: །སྐྱེ་དགུ་ཐར་བྱེད་སངས་རྒྱས་གྱུར་ཅིག་ཅེས། །བྱང་ཆུབ་ཕྱིར་ནི་ཁྱོད་ཀྱིས་སེམས་ཀྱང་བསྐྱེད།
en: ‘May I become a buddha who liberates beings!’ {1}

source: །དཔའ་བོས་བསྐལ་པ་བྱེ་བ་མང་སྤྱད་དེ།
en: “Hero, for many millions of eons, constantly,

source: །སྦྱིན་དང་དུལ་དང་ལེགས་སྡོམ་རྟག་ཏུ་གནས།
en: You practiced generosity, self-restraint and self-control,

source: །བཟོད་དང་ཚུལ་ཁྲིམས་དེ་བཞིན་བརྩོན་འགྲུས་དེས།
en: Patience, correct conduct, and similarly diligence,

source: །སྦྱིན་པ་དག་ཀྱང་མཐའ་ཡས་རྒྱ་ཆེར་བྱིན།
en: And your acts of generosity were vast and infinite. {2}

source: །རྐང་ལག་དང་ནི་སྲོག་ཀྱང་རབ་གཏོང་ཞིང་། །ཁྱོད་ཀྱི་ཡིད་ལ་ནམ་ཡང་སྐྱོ་མེད་དེ།
en: “Without ever any sadness in your mind You gave away your legs, arms, and even your life,

source: །གསེར་དངུལ་དེ་བཞིན་བུ་དང་ཆུང་མ་དང་། །ཆགས་མེད་གྱུར་ནས་རྒྱལ་པོའི་སྲིད་ཀྱང་གཏོང་།
en: And similarly, without attachment you gave away Gold, silver, sons, wives, and your kingdom. {3}

source: །ཁྱོད་ཀྱི་ཚུལ་ཁྲིམས་དྲི་མེད་རྣམ་དག་སྟེ།
en: “Your conduct was stainless and pure.

source: །བདག་ཉིད་གཏོང་ཞིང་ཚུལ་ཁྲིམས་ཡོང་མི་འདྲལ།
en: You made a gift of yourself without ruining your conduct.

source: །ལུས་དང་ངག་དང་ཡིད་ཀྱང་རབ་ཏུ་བསྡམས།
en: You controlled well your body, speech, and mind.

source: །བདེ་གཤེགས་སེམས་དུལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Sugata who has a self-restrained mind, I pay homage to you. {4}

source: །བཟོད་ལ་དགྱེས་ཤིང་བཟོད་པའི་ལམ་ལ་གནས།
en: “Delighting in patience, residing on the path of patience,

source: །ལུས་ནི་དུམ་བུར་བྱས་ཀྱང་འཁྲུགས་མེད་དེ།
en: Even though your body was cut into pieces you were not angered;

source: །བྱམས་པ་བསྒོམས་པས་དེ་ལས་འོ་མ་ཟགས།
en: Through your meditation on love, milk flowed from you.

source: །བདེ་གཤེགས་ངོ་མཚར་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Marvelous Sugata, I pay homage to you. {5}

source: །སྟོབས་བཅུ་དག་གི་སྟོབས་དང་ལྡན་གྱུར་ཅིང་།
en: “You possess the strength of the ten strengths.

source: །ཆགས་མེད་ཡེ་ཤེས་གནས་པས་ཆོས་ཀུན་རྟོགས།
en: With wisdom free of attachment you know all phenomena.

source: །ཐུགས་རྗེས་འཇིག་རྟེན་ཕན་མཛད་ཆོས་ཀྱི་རྗེ།
en: With compassion, Lord of Dharma, you benefit the world.

source: །སྐྱེ་དགུ་འདི་ཡི་དོན་བཞེད་ཐུགས་བརྩེ་བ།
en: Through your kindness you wish to benefit beings. {6}

source: །སྟོང་པར་མཁྱེན་ཅིང་འདི་ན་སེམས་ཅན་མེད།
en: “You know emptiness and that there are no such beings,

source: །དེ་བཞིན་འཇིག་རྟེན་ལམ་སྟོར་གཟིགས་ནས་ནི།
en: And likewise you see that the world’s beings have lost that path.

source: །དེ་དག་རང་བཞིན་བདག་མེད་ཆོས་རྟོགས་བགྱིས།
en: You have realized that the nature of phenomena is selfless

source: །རྣམ་གྲོལ་སྐྱེས་ཀྱང་གང་ནའང་རྣམ་གྲོལ་མེད།
en: And that though you bring beings to liberation, there is no such liberation. {7}

source: །སོ་སོར་བརྟགས་ཏེ་བག་མེད་ཐམས་ཅད་སྤངས།
en: “With discrimination you reject all carelessness.

source: །བདུད་སྡེ་མཐའ་ཡས་སྟོབས་དང་ལྡན་པ་བཅོམ།
en: You have conquered the infinite, powerful māras.

source: །ཡེ་ཤེས་མཐའ་ཡས་བྱང་ཆུབ་རྒྱ་ཆེར་མཁྱེན།
en: Enlightened at buddhahood, you have vast, infinite wisdom.

source: །མཆོག་ཏུ་རྣམ་དག་ཞི་བའི་ཆོས་ཀྱང་སྟོན།
en: You teach the supreme Dharma of completely pure peace. {8}

source: །ཟླ་བ་སྐར་མར་བཅས་པ་གནམ་ལྷུང་ཞིང་།
en: “The sky with its moon and the stars may fall,

source: །རི་དང་གྲོང་དུ་བཅས་པའི་ས་ཞིག་ལ།
en: The earth with its mountains and towns may be destroyed,

source: །ནམ་མཁའི་ཁམས་ནི་རྣམ་པ་གཞན་གྱུར་ཀྱང་།
en: The element of space may change into something else,

source: །ཁྱོད་ནི་མི་བདེན་པ་ཡི་ཚིག་མི་གསུང་།
en: But you will never speak an untrue word. {9}

source: །སྐྱེ་དགུ་དམིགས་པ་དག་ལ་དགའ་བ་དང་། །སེམས་ཅན་སྡུག་བསྔལ་ཁྱོད་ཀྱིས་གཟིགས་ནས་ནི།
en: “You have seen the suffering of beings Who take joy in the perception of objects.

source: །སྟོང་པ་ཉིད་དང་ཟབ་ཅིང་ཞི་བ་ཡིན།
en: You teach the profound peace, emptiness,

source: །དམིགས་པ་མེད་པ་དག་ནི་སྟོན་པར་མཛད།
en: In which there is no perception of objects. {10} “Great hero, you trained

source: །བསྐལ་པ་བྱེ་བ་བསམ་ཡས་སུ།
en: For countless millions of eons

source: །མི་དམིགས་པ་ཡི་བསླབ་པ་ལ། །དཔའ་བོ་ཆེན་པོས་བསླབས་པས་ན།
en: In the training of nonperception,

source: །ཁྱོད་ལ་འཁྲུལ་པ་ཡོང་མི་མངའ།
en: And so you are free of error. {11}

source: །ཇི་ལྟ་བུ་ཡི་ཆོས་བསླབས་པ།
en: “Just as you have trained in the Dharma,

source: །དེ་ལྟ་བུ་ཡི་ཆོས་སྟོན་ཏེ།
en: In that way you teach the Dharma. Yours is not the level of foolish beings,

source: །མུ་སྟེགས་གཞན་དག་ཇི་སྙེད་དང་། །བྱིས་པ་དག་གིས་ས་འདི་མིན།
en: And neither is it the level of all the tīrthikas. {12}

source: །བདག་ཏུ་འདུ་ཤེས་གང་གནས་པ།
en: “Those who have the conception of a self,

source: །མི་མཁས་དེ་དག་འཁྲུལ་པར་འགྱུར།
en: They are unwise beings who are in error.

source: །ཆོས་རྣམས་བདག་མེད་རིག་པས་ན།
en: You know that phenomena have no self,

source: །དཔའ་བོ་ཆེན་པོ་ཡང་དག་གསུང་།
en: “You speak the truth, great hero;

source: །ཡང་དག་ཆོས་ལ་རབ་ཏུ་གནས།
en: You are established in the true Dharma.

source: །མགོན་པོ་ཡང་དག་བདེན་གནས་ཏེ།
en: Lord, you remain within truth, within veracity,

source: །ཡང་དག་ཚིག་ནི་རབ་ཏུ་གསུང་།
en: And you speak words that are true. {14} “Your conduct has been true,

source: །ཁྱོད་ཀྱི་སྨོན་ལམ་བཏབ་པ་བཞིན།
en: Just as you have prayed for.

source: །ཁྱོད་ཀྱི་ཡང་དག་སྤྱོད་པ་བྱུང་། །ཡང་དག་དེ་ཡི་རྒྱུ་འདྲ་བས།
en: You have the consequence of that true conduct

source: །ཡང་དག་སྤྱོད་པ་ཕུན་སུམ་ཚོགས།
en: “You have perfected true conduct.

source: །ཡང་དག་མཐའ་ལ་ཤིན་ཏུ་བསླབས།
en: You have trained in the summit of truth.

source: །ཡང་དག་བསམ་པ་ཡང་དག་སྤྱོད།
en: You have truly practiced with a true motivation.

source: །ཡང་དག་མཁྱེན་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you who have true wisdom. {16}

source: །ཁྱོད་ཀྱི་ཤེས་རབ་མཉམ་པ་མེད།
en: “There is no equal to your wisdom.

source: །ཡེ་ཤེས་གསུང་བ་འོད་མཛད་པ།
en: Your words of wisdom illuminate.

source: །ཡེ་ཤེས་ཁྱད་པར་རབ་བརྙེས་ཤིང་།
en: You have attained unique wisdom.

source: །ཡེ་ཤེས་གསུང་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you who speak words of wisdom. {17}

source: །ཁྱོད་ཀྱིས་བྱམས་པ་རབ་བསྒོམས་ཏེ།
en: “You have meditated on kindness

source: །སེམས་ཅན་ཀུན་གྱི་བཤེས་གཉེན་ཁྱོད།
en: And become a friend to all beings.

source: །རི་རབ་བཞིན་དུ་མི་སྒུལ་ཏེ།
en: You are as unshakable as Sumeru.

source: །མི་གཡོ་རབ་ཏུ་གནས་པ་པོ།
en: You are completely stable and unwavering. {18}

source: །སྟོན་པའི་འཁོར་ཚོགས་རྒྱ་ཆེ་ཡང་།
en: “Teacher, your following is vast.

source: །ཚོགས་མང་དག་ཀྱང་སྡུད་པར་མཛད།
en: You have attracted these followers.

source: །ཤེས་རབ་ཟབ་མོ་བདེ་བར་གཤེགས།
en: Sugata who has profound wisdom,

source: །འཁོར་གྱི་ནང་གཤེགས་སྒྲ་ཡང་སྒྲོག །སངས་རྒྱས་སེང་གེའི་སྒྲ་སྒྲོགས་ཤིང་།
en: Make your voice resound within this assembly. {19} “The voice of the Buddha is a lion’s roar.

source: །སེང་གེའི་སྟབས་སུ་རྣམ་པར་གཤེགས།
en: You walk with the gait of a lion.

source: །ཁྱོད་ཀྱིས་མུ་སྟེགས་ཀུན་བཏུལ་བ།
en: You defeat all the tīrthikas

source: །སེང་གེ་ཡིས་ནི་ཝ་རྣམས་བཞིན།
en: Like a lion defeats jackals. {20}

source: །དཔའ་བོ་མ་དུལ་དུལ་མཛད་པ།
en: “Hero who subdues the unsubdued,

source: །མ་དུལ་བ་དག་ཁྱོད་ཀྱིས་བཏུལ།
en: The unsubdued are subdued by you.

source: །དེ་དག་མཛའ་སྡུག་བརྟན་གྱུར་ཏེ།
en: They become friends who are reliable,

source: །དབྱེར་མི་ཕྱེད་ཅིང་ལེགས་པར་གནས།
en: Inseparable, and pleasant to be with. {21}

source: །ལྟ་བ་སྣ་ཚོགས་གནས་པ་ཡི། །སེམས་ཅན་སྡུག་བསྔལ་གཟིགས་ནས་ནི།
en: “You see the beings who are suffering

source: །སྡུག་དང་མི་སྡུག་མེད་པ་ཡི།
en: Because they maintain the view of a self.

source: །བདག་མེད་ཆོས་ནི་ཁྱོད་སྟོན་ཏེ།
en: You teach the Dharma of no-self In which there is neither like nor dislike. {22}

source: །མ་བསླབས་པ་ཡི་བྱིས་པ་དག །ལོག་པའི་ལམ་ལ་སྤྱོད་པ་རྣམས། །འདྲེན་པ་གང་ནས་གཤེགས་པ་ཡི།
en: “The foolish who are untrained Take up the wrong paths.

source: །ལམ་ཡང་རབ་ཏུ་ཁྱོད་ཀྱིས་བསྟན།
en: You show them the path That the guides have followed. {23}

source: །བདག་ཏུ་འཛིན་ལ་སུ་གནས་པ།
en: “Whoever holds to the concept of a self,

source: །དེ་དག་སྡུག་བསྔལ་ཉིད་ལ་གནས།
en: They will remain in suffering.

source: །གང་ལ་སྡུག་བསྔལ་མེད་པ་ཡི། །བདག་མེད་དེ་དག་མི་ཤེས་སོ།
en: They do not know selflessness, Within which there is no suffering. {24}

source: །འཁྲུལ་པ་མེད་པའི་ཆོས་ཚིག་ཁྱོད་སྟོན་ཏེ།
en: “You teach the Dharma with words that are without error.

source: །ཁྱོད་ལ་འཁྲུལ་པ་མི་རྙེད་འཇིག་རྟེན་མགོན།
en: Lord of the World, you make no error.

source: །ཁྱོད་ནི་མ་ལོག་པ་ཡི་ཚིག་གསུང་སྟེ།
en: You are one who speaks words that are never incorrect.

source: །སྡུག་བསྔལ་མང་ཐར་མཛད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, who bring freedom from suffering. {25}

source: །ལྷ་ཀླུ་གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག །བརྒྱ་སྟོང་མང་པོ་མཁའ་ལ་འཁོད་པ་རྣམས།
en: “In the sky there are many quintillions Of devas, nāgas, and yakṣas.

source: །བཅོམ་ལྡན་འདས་ཀྱི་དོན་ལྡན་གསུང་ཐོས་ནས། །ཐམས་ཅད་འདྲེན་ལ་རབ་ཏུ་དགའ་བ་སྐྱེད།
en: They all feel joy in the Guide When they hear the meaningful words of the Bhagavān. {26}

source: །ཚིག་ནི་རབ་ཏུ་སྙན་ཅིང་བཟང་ལ་འཐད། །མཉེན་ཞིང་འཇམ་ལ་ཡིད་འོང་དུས་དང་འབྱོར།
en: “Your words are mild, gentle, and pleasing, Timely, melodious, appropriate, and beloved.

source: །གསུང་གི་ཡན་ལག་དཔག་ཏུ་མེད་དང་ལྡན།
en: You have the countless qualities of speech

source: །ཕན་བྱེད་སྐྱེ་བོ་མང་པོ་ཐར་བྱེད་པ།
en: That benefit and bring liberation to many beings. {27}

source: །སིལ་སྙན་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་དང་། །ལྷ་ཡི་དབྱངས་སྒྲ་དགའ་བར་འགྱུར་བའི་མཆོག །
en: “Countless hundreds of thousands of musical instruments

source: ཤིན་ཏུ་སྙན་པ་དུས་གཅིག་འབྱོར་གྱུར་ཀྱང་།
en: Are all played melodiously and simultaneously,

source: །བདེ་གཤེགས་གསུང་གཅིག་གིས་ནི་ཟིལ་གྱིས་ནོན།
en: But the Sugata with one word eclipses them all With his unique, divine, beloved voice. {28}

source: །ཁུ་བྱུག་བྱ་མང་འཇམ་པའི་སྒྲ་འབྱིན་དང་། །ཀུན་ལ་ཤིན་ཏུ་ཡིད་འཐད་དབྱངས་སྙན་དག །བྱ་ཚོགས་མང་པོ་ཐམས་ཅད་སྒྲ་འབྱིན་པ།
en: “Avadavats and flocks of birds with beautiful songs, With their beautiful songs that are pleasing to everyone— All of the songs of these many flocks of birds

source: །སངས་རྒྱས་གསུང་གི་ཆར་ཡང་དེས་མི་ཕོད།
en: Cannot equal a fraction of the Buddha’s speech. {29}

source: །ལྷ་ཡི་བུ་མོ་སྒྲ་དབྱངས་སྙན་པ་དང་། །སིལ་སྙན་རོལ་མོ་གླུ་དབྱངས་འཇམ་པ་དང་། །པི་བང་རྫ་རྔ་རྔ་ཆེན་དུང་གི་སྒྲ།
en: “Deva maidens with beautiful voices And with melodious music and songs, And the sound of lutes, paṭaha drums, bherī drums, and conches,

source: །དེ་དག་སངས་རྒྱས་གསུང་གི་ཆར་མི་ཕོད།
en: Cannot equal a fraction of the Buddha’s speech. {i}
